app/Controllers/Clientes.php

SELECT *
FROM `clientes`
WHERE `estado` = 1
---
     public function index($estado = 1)
    {
        $clientes = $this->clientes->where('estado',$estado)->findAll();

SELECT *
FROM `clientes`
WHERE `ci_nit` LIKE '%14%' ESCAPE '!'
AND `estado` = 1
---
   public function autocompleteData(){
        $returnData = array();
        $valor =$this->request->getGet('term');
        $clientes =$this->clientes->like('ci_nit',$valor)->where('estado',1)->findAll();