app/Controllers/Empleados.php

SELECT *
FROM `empleados`
WHERE `estado` = 1
---
     public function index($estado = 1)
    {
        $empleados = $this->empleados->where('estado',$estado)->findAll();

SELECT *
FROM `permisos`
---
    public function detalles(){
        $permisos= $this->permisos->findAll();