app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `estado` = 1
---
     public function index($estado = 1)
    {
        $productos = $this->productos->where('estado',$estado)->findAll();

SELECT *
FROM `categorias`
WHERE `estado` = 1
---
     public function nuevo()
    {


      $categorias = $this->categorias->where('estado',1)->findAll();

SELECT *
FROM `productos`
WHERE `id_Producto` = '9'
 LIMIT 1
---
    public function editar($id)
    {
        $productos = $this->productos->where('id_Producto',$id)->first();

SELECT *
FROM `productos`
WHERE `codigo` LIKE '%140101%' ESCAPE '!'
AND `estado` = 1
---
    public function autocompleteData1(){
        $returnData = array();
        $valor =$this->request->getGet('term');
        $productos =$this->productos->like('codigo',$valor)->where('estado',1)->findAll();