app/Controllers/Temporal.php

    public function insertar($id_Producto,$cantidad,$id_compra)
    {


            $error='';
            $productos =$this->productos->where('id_Producto',$id_Producto)->first();
---
SELECT *
FROM `productos`
WHERE `id_Producto` = '12'
 LIMIT 1