app/Controllers/Usuarios.php

     public function index($estado = 1)
    {
        $userModel = new UsuariosModel();
        $usuarios = $userModel->getUsersWithRoles();
        $empleados = $this->empleados->where('rol')->findAll();
        $usuarios = $this->usuarios->where('estado',$estado)->findAll();
---
SELECT *
FROM `empleados`
WHERE `rol` IS NULL
SELECT *
FROM `usuarios`
WHERE `estado` = 1

    public function valida()
    {
        if($this->request->getMethod() =="post"){
            $usuario =$this->request->getPost('usuario');
            $passwordAlfanumerico =$this->request->getPost('password');

            $datosUsuario = $this ->usuarios->where('usuario',$usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'vdsvs'
 LIMIT 1