app/Models/UsuariosModel.php

          public function getUsersWithRoles()
          {
              return $this->select('usuarios.*, rol AS rol_nombre')
                  ->join('empleados', 'empleados.id_Empleado = usuarios.id_Empleado')
                  ->findAll();
---
SELECT `usuarios`.*, `rol` AS `rol_nombre`
FROM `usuarios`
JOIN `empleados` ON `empleados`.`id_Empleado` = `usuarios`.`id_Empleado`